#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA8 (0x2C8 - 0x220)
// BlueprintGeneratedClass BP_WallOut.BP_WallOut_C
class ABP_WallOut_C : public AActor
{
public:
	class URectLightComponent*                   RectLight3;                                        // 0x220(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                   RectLight2;                                        // 0x228(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                   RectLight1;                                        // 0x230(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Foundation_mesh;                                   // 0x238(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  WallIn_mesh;                                       // 0x240(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  WallOut_mesh;                                      // 0x248(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x250(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	enum class E_WallOut                         WallOut;                                           // 0x258(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Foundation;                                        // 0x259(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Interior_Wall;                                     // 0x25A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         WallIn_B;                                          // 0x25B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Bent_Interior_Wall;                                // 0x25C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Revert_Default_Materials;                          // 0x25D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Lightmass_Portal;                                  // 0x25E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         RectLight;                                         // 0x25F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                        Window_Vinyl_Open;                                 // 0x260(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Window_Vinyl_Double_Open;                          // 0x264(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                   Wall_Out_Meshes;                                   // 0x268(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                   Foundation_Meshes;                                 // 0x278(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                   Wall_in_A_Meshes;                                  // 0x288(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                   Wall_in_A_Bent_Meshes;                             // 0x298(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                   Wall_in_B_Meshes;                                  // 0x2A8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                   Wall_in_B_Bent_Meshes;                             // 0x2B8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class ABP_WallOut_C* GetDefaultObj();

	void UserConstructionScript(int32 Number_Of_Materials, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_MapRangeClamped_ReturnValue, float CallFunc_MapRangeClamped_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue_1, class UChildActorComponent* CallFunc_AddComponent_ReturnValue, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_1, float CallFunc_MapRangeClamped_ReturnValue_2, float CallFunc_MapRangeClamped_ReturnValue_3, const struct FVector& CallFunc_MakeVector_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue_3, const struct FTransform& CallFunc_MakeTransform_ReturnValue_2, const struct FTransform& CallFunc_MakeTransform_ReturnValue_3, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_2, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_3, const struct FTransform& CallFunc_MakeTransform_ReturnValue_4, const struct FHitResult& CallFunc_K2_SetRelativeTransform_SweepHitResult, const struct FTransform& CallFunc_MakeTransform_ReturnValue_5, const struct FHitResult& CallFunc_K2_SetRelativeTransform_SweepHitResult_1, const struct FTransform& CallFunc_MakeTransform_ReturnValue_6, const struct FHitResult& CallFunc_K2_SetRelativeTransform_SweepHitResult_2, const struct FTransform& CallFunc_MakeTransform_ReturnValue_7, const struct FHitResult& CallFunc_K2_SetRelativeTransform_SweepHitResult_3, const struct FTransform& CallFunc_MakeTransform_ReturnValue_8, const struct FHitResult& CallFunc_K2_SetRelativeTransform_SweepHitResult_4, const struct FTransform& CallFunc_MakeTransform_ReturnValue_9, const struct FHitResult& CallFunc_K2_SetRelativeTransform_SweepHitResult_5, const struct FTransform& CallFunc_MakeTransform_ReturnValue_10, const struct FHitResult& CallFunc_K2_SetRelativeTransform_SweepHitResult_6, const struct FTransform& CallFunc_MakeTransform_ReturnValue_11, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_4, const struct FTransform& CallFunc_MakeTransform_ReturnValue_12, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_5, const struct FTransform& CallFunc_MakeTransform_ReturnValue_13, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_6, const struct FTransform& CallFunc_MakeTransform_ReturnValue_14, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_7, const struct FTransform& CallFunc_MakeTransform_ReturnValue_15, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_8, int32 Temp_int_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Conv_ByteToInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, class UStaticMesh* CallFunc_Array_Get_Item, bool CallFunc_SetStaticMesh_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, class UStaticMesh* CallFunc_Array_Get_Item_1, bool CallFunc_SetStaticMesh_ReturnValue_1, const struct FTransform& CallFunc_MakeTransform_ReturnValue_16, int32 CallFunc_Conv_ByteToInt_ReturnValue_2, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_9, class UStaticMesh* CallFunc_Array_Get_Item_2, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_10, bool CallFunc_SetStaticMesh_ReturnValue_2, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_11, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_12, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_13, const struct FTransform& CallFunc_MakeTransform_ReturnValue_17, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_14, bool K2Node_SwitchEnum_CmpSuccess, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_15, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_16, bool K2Node_SwitchEnum_CmpSuccess_1, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_2, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_3, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_4, bool K2Node_SwitchEnum_CmpSuccess_2, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_5, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_6, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_7, int32 CallFunc_Conv_ByteToInt_ReturnValue_3, class UStaticMesh* CallFunc_Array_Get_Item_3, int32 CallFunc_GetNumMaterials_ReturnValue, int32 CallFunc_GetNumMaterials_ReturnValue_1, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue, int32 Temp_int_Variable_2, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, const struct FTransform& CallFunc_MakeTransform_ReturnValue_18, const struct FTransform& CallFunc_MakeTransform_ReturnValue_19, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_17, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_18, const struct FTransform& CallFunc_MakeTransform_ReturnValue_20, class UChildActorComponent* CallFunc_AddComponent_ReturnValue_19, int32 CallFunc_Conv_ByteToInt_ReturnValue_4, class UStaticMesh* CallFunc_Array_Get_Item_4, bool CallFunc_SetStaticMesh_ReturnValue_3, int32 CallFunc_Conv_ByteToInt_ReturnValue_5, class UStaticMesh* CallFunc_Array_Get_Item_5, bool CallFunc_SetStaticMesh_ReturnValue_4, bool CallFunc_SetStaticMesh_ReturnValue_5, bool CallFunc_LessEqual_IntInt_ReturnValue_2, int32 CallFunc_GetNumMaterials_ReturnValue_2, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue_2);
};

}


