#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x148 (0x7F8 - 0x6B0)
// BlueprintGeneratedClass INTERACTIVE_FoliageComp_BP.INTERACTIVE_FoliageComp_BP_C
class UINTERACTIVE_FoliageComp_BP_C : public UFoliageInstancedStaticMeshComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x6B0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	float                                        Trample_BendAngle_WEIGHT;                          // 0x6B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Trample_ZMinusScale_WEIGHT;                        // 0x6BC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Trample_BendDuration_MULTIPLIER;                   // 0x6C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        BendAway_Angle_WEIGHT;                             // 0x6C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        BendAway__ZMinusScale_WEIGHT;                      // 0x6C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        BendAway_Duration_MULTIPLIER;                      // 0x6CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AInteractiveGrassManager_BP_C*         Manager;                                           // 0x6D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TArray<int32>                                TrampledInstances;                                 // 0x6D8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	float                                        UnDeformSpeed;                                     // 0x6E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        UnDeformSpeedWhenTrampled;                         // 0x6EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            UnloadedViaStreaming;                              // 0x6F0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                        ChunkSize_;                                        // 0x700(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OkToChunk;                                         // 0x704(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_203F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               UpperLeftBBoxCorner;                               // 0x708(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        UpperLeftCorner_X;                                 // 0x714(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        UpperLeftCorner_Y;                                 // 0x718(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        UpperLeftCorner_Z;                                 // 0x71C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        X;                                                 // 0x720(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ChunkAmount_X;                                     // 0x724(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ChunkAmount_Y;                                     // 0x728(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        I;                                                 // 0x72C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        J;                                                 // 0x730(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2040[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UINTERACTIVE_FoliageComp_BP_C*> ChunkedComponents;                                 // 0x738(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                        QuarterOfInstances;                                // 0x748(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ChunkNrX;                                          // 0x74C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ChunkNrY;                                          // 0x750(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2041[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Transform;                                         // 0x760(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TMap<int32, struct FInstanceData>            InstanceData;                                      // 0x790(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        DeformingOptimization;                             // 0x7E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2042[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTransform>                    TEMP_InstancesToAdd;                               // 0x7E8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UINTERACTIVE_FoliageComp_BP_C* GetDefaultObj();

	void Start_New_Instance_Offset(int32 Instance, const struct FVector& NewOffset, float DeformDuration, float UnDeformSpeed, bool UpdateComponent, float IgnoreIfGrowing, float FinalUnDeformSpeed, const struct FVector& NewPrevOffset, float StartTime, bool Ignore, float DeformAlpha, bool HasInstanceData, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, bool CallFunc_SetCustomDataValue_ReturnValue, bool CallFunc_SetCustomDataValue_ReturnValue_1, bool CallFunc_SetCustomDataValue_ReturnValue_2, bool CallFunc_SetCustomDataValue_ReturnValue_3, bool CallFunc_GetCurrentInstanceDeformAlpha_HasInstanceData, float CallFunc_GetCurrentInstanceDeformAlpha_CurrentAlpha, bool CallFunc_SetCustomDataValue_ReturnValue_4, const struct FVector& CallFunc_GetCurrentInstanceGPU_Offset_CurrentOffset, bool CallFunc_SetCustomDataValue_ReturnValue_5, float CallFunc_GetTimeSeconds_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, const struct FInstanceData& K2Node_MakeStruct_InstanceData, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, bool CallFunc_SetCustomDataValue_ReturnValue_6, bool CallFunc_SetCustomDataValue_ReturnValue_7, bool CallFunc_SetCustomDataValue_ReturnValue_8, bool CallFunc_Less_FloatFloat_ReturnValue);
	void ForceMarkDirty(const struct FTransform& CallFunc_GetInstanceTransform_OutInstanceTransform, bool CallFunc_GetInstanceTransform_ReturnValue, bool CallFunc_UpdateInstanceTransform_ReturnValue);
	void GetCurrentInstanceUNMinusDeformAlpha(int32 InstanceIndex, bool* HasInstanceData, float* CurrentAlpha, const struct FInstanceData& InstData, const struct FInstanceData& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Map_Contains_ReturnValue, float CallFunc_GetTimeSeconds_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue);
	void GetCurrentInstanceGPU_Offset(int32 InstanceIndex, bool AtSpecifiedAlpha, float SpecifiedAlpha, struct FVector* CurrentOffset, const struct FInstanceData& InstData, float Alpha, bool CallFunc_GetCurrentInstanceDeformAlpha_HasInstanceData, float CallFunc_GetCurrentInstanceDeformAlpha_CurrentAlpha, const struct FInstanceData& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Map_Contains_ReturnValue, const struct FVector& CallFunc_VLerp_ReturnValue, float CallFunc_GetTimeSeconds_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue);
	void GetCurrentInstanceDeformAlpha(int32 InstanceIndex, bool* HasInstanceData, float* CurrentAlpha, const struct FInstanceData& InstData, const struct FInstanceData& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Map_Contains_ReturnValue, float CallFunc_GetTimeSeconds_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue);
	void Copy_SetFoliageParameters_FromClass(class UClass* CopyFrom, class UStaticMesh* MeshToSet, bool CallFunc_SetStaticMesh_ReturnValue);
	void Copy_SetFoliageParameters(class UINTERACTIVE_FoliageComp_BP_C* CopyFrom, bool CallFunc_SetStaticMesh_ReturnValue);
	void RemoveAnyActiveStatuses(int32 InstanceIndex, bool CallFunc_IsTrampled___);
	void IsTrampled_(int32 InstanceIndex, bool* _, bool CallFunc_Array_Contains_ReturnValue);
	void RemoveInstanceStatus(int32 InstanceIndex, enum class EInstanceStatus Status, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Array_RemoveItem_ReturnValue);
	void AddInstanceStatus(int32 InstanceIndex, enum class EInstanceStatus Status, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_Array_Add_ReturnValue);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void DivideIntoChunks_InfLoopWorkaround(float ChunkSize);
	void ExecuteUbergraph_INTERACTIVE_FoliageComp_BP(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_GetInstanceCount_ReturnValue, float CallFunc_GetGameTimeInSeconds_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, TArray<class AInteractiveGrassManager_BP_C*>& CallFunc_GetAllActorsOfClass_OutActors, bool CallFunc_BooleanAND_ReturnValue, class AInteractiveGrassManager_BP_C* CallFunc_Array_Get_Item, bool CallFunc_IsValid_ReturnValue, enum class EEndPlayReason K2Node_Event_EndPlayReason, float K2Node_CustomEvent_chunkSize, const struct FVector& CallFunc_GetComponentBounds_Origin, const struct FVector& CallFunc_GetComponentBounds_BoxExtent, float CallFunc_GetComponentBounds_SphereRadius, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, float CallFunc_Multiply_FloatFloat_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, int32 CallFunc_FCeil_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue_1, int32 Temp_int_Variable_1, int32 CallFunc_FCeil_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue, float CallFunc_BreakVector_X_2, float CallFunc_BreakVector_Y_2, float CallFunc_BreakVector_Z_2, int32 Temp_int_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, float CallFunc_Divide_FloatFloat_ReturnValue_2, float CallFunc_Multiply_IntFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue_1, float CallFunc_Divide_FloatFloat_ReturnValue_3, float CallFunc_BreakVector_X_3, float CallFunc_BreakVector_Y_3, float CallFunc_BreakVector_Z_3, float CallFunc_Multiply_IntFloat_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue_3, float CallFunc_Add_FloatFloat_ReturnValue_4, bool CallFunc_Greater_FloatFloat_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue_1, class AInteractiveFoliageChunk_BP_C* CallFunc_AddFoliageChunkActor_addedChunk, int32 CallFunc_Array_Add_ReturnValue, int32 Temp_int_Variable_3, const struct FVector& CallFunc_GetComponentBounds_Origin_1, const struct FVector& CallFunc_GetComponentBounds_BoxExtent_1, float CallFunc_GetComponentBounds_SphereRadius_1, class AInteractiveFoliageChunk_BP_C* CallFunc_AddFoliageChunkActor_addedChunk_1, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 CallFunc_GetInstanceCount_ReturnValue_1, int32 CallFunc_Divide_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_2, int32 Temp_int_Variable_4, const struct FTransform& CallFunc_GetInstanceTransform_OutInstanceTransform, bool CallFunc_GetInstanceTransform_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, bool CallFunc_LessEqual_IntInt_ReturnValue_1, float CallFunc_BreakVector_X_4, float CallFunc_BreakVector_Y_4, float CallFunc_BreakVector_Z_4, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 CallFunc_Multiply_IntInt_ReturnValue, int32 CallFunc_Multiply_IntInt_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue_3, bool CallFunc_LessEqual_IntInt_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_4, bool CallFunc_LessEqual_IntInt_ReturnValue_3, int32 CallFunc_Multiply_IntInt_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_5, bool CallFunc_LessEqual_IntInt_ReturnValue_4, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue_5, class UINTERACTIVE_FoliageComp_BP_C* CallFunc_Array_Get_Item_1, TArray<int32>& CallFunc_AddInstances_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Variable_5, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue_5, int32 CallFunc_Add_IntInt_ReturnValue_6, int32 K2Node_MathExpression_ReturnValue, class UINTERACTIVE_FoliageComp_BP_C* CallFunc_Array_Get_Item_2, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, const struct FTransform& CallFunc_ConvertTransformToRelative_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1);
	void UnloadedViaStreaming__DelegateSignature();
};

}


